{
    "storeShortDesc": "<p><strong>AJIO – Digital Fashion & Lifestyle Brand from Reliance</strong></p>\n                          <p>Ajio is the digital fashion and lifestyle brand. Ajio is an extension of Reliance. Ajio deals fashion and lifestyle space in india as an electronic commerce company, which is headquartered in Bangalore, India. AJIO was launched in 2016 by Reliance Retail.</p>            <p>The fashion brand from Reliance Jio Digital Life has launched a campaign titled “Doubt is Out” to go with the brand's philosophy. Fashion that is bang-on-trend, and hand-picked by a team of stylists, buyers and designers.</p>",
    "storeFullDesc": "<p><strong>AJIO – Digital Fashion & Lifestyle Brand from Reliance</strong></p>\n                          <p>Ajio is the digital fashion and lifestyle brand. Ajio is an extension of Reliance. Ajio deals fashion and lifestyle space in india as an electronic commerce company, which is headquartered in Bangalore, India. AJIO was launched in 2016 by Reliance Retail.</p>\n                      <p>AJIO deals many brands from US, Russia, Turkey, Singapore and Australia besides other countries. Its focus on high-fashion designer wear from international brands, affordable international brands, in-house brands and handpicked products from local designers. AJIO company leverages from its strong network of Reliance trends retail stores and Jio retail stores for delivery purposes. Currently reliance group operates more than 2621 outlets across India. It aims to be different from all other offerings currently in the market by being an Omni channel brand. AJIO deals MDS from Singapore, Aeropostale from America, Closet London from London, Point Zero from Canada and many more as well.</p>\n                                <p>The fashion brand from Reliance Jio Digital Life has launched a campaign titled “Doubt is Out” to go with the brand's philosophy. Fashion that is bang-on-trend, and hand-picked by a team of stylists, buyers and designers.</p>\n\n\t\t\t\t\t\t\t\t<span>\n<p><strong>PRODUCTS:</strong></p>\n                  <p>Ajio deals in categories of womenswear, menswear, kids wear and technology.  Ajio offers exclusive collections of International brands.</p>\n\t\t\t\t  <ul>\n<li>Coats jeans</li>\n<li>Dresses Jackets</li>\n<li>Jeggings Jumpsuits</li>\n<li>Playsuits</li>\n<li>Leggings</li>\n<li>Shirts</li>\n<li>Shorts</li>\n<li>Shrugs</li>\n<li>Boleros Skirts</li>\n<li>Swimwear</li>\n<li>Tops</li>\n<li>Track Pants</li>\n<li>Trousers and pants</li>\n<li>T-shirts</li>\n</ul>\n</span>\n\n<span>\n<p><strong>PAYMENT METHODS:</strong></p>\n                             <p>AJIO offers multiple payment options to users, which includes</p>\n\t\t\t\t\t\t\t <ul>\n<li>Net banking</li>\n<li>VISA card</li>\n<li>Master card</li>\n<li>Cash on Delivery</li>\n<li>Jio Money</li>\n<li>Credit card</li>\n<li>Debit card</li>\n<li>Store card</li>\n<li>Prepaid payment instruments and electronic wallets</li>\n<li>Equated Monthly Installments</li>\n<li>Any other payment options as may be provided by AJIO from time to time.</li>\n</ul>\n</span>\n\n<span>\n<p><strong>SWOT ANALYSIS:</strong></p>\n         <p>SWOT means [Strength, Weakness, Opportunities, Threats]. In SWOT analysis Strengths, Weaknesses are an Internal factors, Opportunities and Threats are an External factor. SWOT analysis is a structured plan method which is used to evaluate the product, plan, Industry or a person in a business venture. This method of evaluation is an essential part of any firm or organization, whether it is a small or big.</p>\n<p><strong>Strength:</strong></p>\n<ul>\n<li>AJIO is an Indian retail chain company. It has more than 3553 stores.</li>\n<li>Ajio offers various private label brands.</li>\n<li>Ajio deals its network as healthiest distribution network.</li>\n<li>Ajio offers high productivity and flexibility.</li>\n<li>AJIO offers a strong Research and development capabilities.</li>\n</ul>\n<p><strong>Weakness:</strong></p>\n<ul>\n<li>Poor inventory control at certain locations is a concern.</li>\n<li>Product variety is available, but more SKUs are not present due to inefficient back end infrastructure.</li>\n</ul>\n<p><strong>Opportunities:</strong></p>\n<ul>\n<li>Large potential to reduce operation cost in cities using strong supply chain.</li>\n<li>An opportunity is any feature of the external environment which creates positive potential for the business to achieve its\n objectives.</li>\n<li>AJIO has the good marketing growth.</li>\n<li>Leveraging on brand name and entering Retail saloon.</li>\n</ul>\n<p><strong>Threats:</strong></p>\n<ul>\n<li>Operating cost are too high.  </li>\n<li>Any external development that may hinder or prevent the hinder or prevent the business from achieving its objectives.     </li>\n</ul>\n</span>\n\n\n<span>\n<p><strong>AWARDS AND ACHIEVEMENTS:</strong></p>\n<ul>\n<li>In 2010, Reliance trends received the “Impactful retail design and visual merchandising of the year award” at the Asia Retail Congress.</li>\n<li>In 2011, received the “Most Admired retailer of store brands award” under the “Apparel and clothing” category at the Primal Label Forum.</li>\n<li>In 2011, It received the “Retailer of the year 2011 award” for the “Fashion and lifestyle” category at the Asia Retail congress.</li>\n<li>In 2012, Reliance Trends receives most promising brand of the year award at North-East consumer awards.</li>\n<li>In 2013, Reliance digital receives star retailer award “Consumer durable retailer of the year”</li>\n<li>In 2014, Reliance trends receives most admired fashion retail destination of the year award by images in India fashion forum.</li>\n<li>Reliance fresh ranked among the “Most Trusted service brands” in India by Brand Equity.</li>\n<li>In 2015, Reliance Jewels received an award in the mid design category in the inaugural Retail Jewellery Guild Awards.</li>\n<li>Reliance Digital was awarded the Retail Leadership Award 2015 – India Retail Awards 2015.</li>\n<li>Reliance digital awarded “Retailer of the Year” by India Retail Awards 2016.</li>\n<li>In 2018, Reliance digital was awarded the “National retailer of the year” by Retail and e-Retail awards.</li>\n<li>Reliance SMART won “Rapid Expansion with SMART Hyper Model” award at IMAGES south India Retail awards 2018.</li>\n<li>Project Eve was awarded the “Most admired retail launch” of the year by IMAGES Retail awards.</li>\n</ul>\n\n<p><strong>SHOPPING VIA couponzcorner:</strong></p>\n              <p>Coupons, offers and discounts plays major roles in online shopping to decide on the purchase by customers. couponzcorner takes care of updating the best deals, coupons, discounts and cashbacks for Ajio shop which makes the customers to just search, apply and save truly some money on Ajio. If you would really like to save money during your online shopping experiences, then feel free to plan and visit our shop to get the working coupons and to save truly some money.</p>\n\t<p>We provide the coupons not only for shops, also for banks and wallets, which helps you to save additional money from your pocket.</p>\n\n\t<span>\n<p><strong>CUSTOMER CARE SUPPORT:</strong></p>\n                               <p>AJIO offers “Customer-first” business strategy. It focuses on customers satisfactions only. AJIO provides 24*7 customer care executives to clarifying the product conformation, product cancellation, payment status, refund options.</p>\n\t\t\t\t\t\t\t   <ul>\n<li>To reach AJIO customer care executives: 1800 8899 991 or 1800 419 8998</li>\n<li>To Shop on AJIO website visit: <a href=\"https://ad.admitad.com/g/gobb106sd960b7bd137fa663530cb9/\">www.ajio.com</a></li>\n</ul>\n</span>\n\n<p><strong>Ajio - In Short</strong></p>\n<table class=\"table table-bordered table-hover table-striped\">\n<tbody>\n<tr>\n<td>Headquartered</td><td>\tMumbai, India</td>\n</tr>\n<tr>\n<td>Parent Company</td><td>\tReliance group</td>\n</tr>\n<tr>\n<td>Industry</td><td>\tRetail</td>\n</tr>\n<tr>\n<td>Key people</td><td>\tChairman Mukesh Ambani</td>\n</tr>\n\t\n<tr>\n<td>Stores</td>\n<td>3500+</td>\n</tr>\n<tr>\n\t\n\t<td>Website</td>\n<td><a href=\"https://ad.admitad.com/g/gobb106sd960b7bd137fa663530cb9/\">www.ajio.com</a></td>\n</tr>\n<tr>\n<td>Customer Care Number</td>\n<td>1800 8899 991 (or) 1800 419 8998</td>\n</tr>\n</tbody>\n</table>",
    "highLightText": "90% OFF",
    "storeName": "Ajio",
    "storeLogo": "ajio.jpg",
    "awsStoreLogo": "assets/imgs/logos/ajio.webp",
    "storeSlug": "ajio-coupons",
    "storeType": "P",
    "storeColor": "#49637A",
    "storeAffiliateUrl": "www.ajio.com"
}